print('Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. ')

print (' вводим целый слова!!')

a = input('покрытая ... : ')

b = input('кож...цей : ')

d = input(' на ... : ')

f = input('ножк... : ')

g = input('затянута ... : ')

y = input('откроется нижняя ... : ')

z = input('шляпк... : ')

print(f'Шляпка гриба, пократая {a} {b}, держится на {d} {f} .Снизу шляпка затянута {g} плёнкой. когда ее уберёшь, откроется нижняя {y}' )